MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F098VC/mcu.h
/****************** UART Instances : Hardware Flow control ********************/
#define IS_UART_HWFLOW_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                           ((INSTANCE) == USART2) || \
                                           ((INSTANCE) == USART3) || \
                                           ((INSTANCE) == USART4))

/****************** UART Instances : LIN mode ********************/
#define IS_UART_LIN_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                        ((INSTANCE) == USART2) || \
                                        ((INSTANCE) == USART3))

/****************** UART Instances : wakeup from stop mode ********************/
#define IS_UART_WAKEUP_FROMSTOP_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                                    ((INSTANCE) == USART2) || \
                                                    ((INSTANCE) == USART3))
/* Old macro definition maintained for legacy purpose */
#define IS_UART_WAKEUP_INSTANCE         IS_UART_WAKEUP_FROMSTOP_INSTANCE

/****************** UART Instances : Driver enable detection ********************/
#define IS_UART_DRIVER_ENABLE_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                                  ((INSTANCE) == USART2) || \
                                                  ((INSTANCE) == USART3) || \
                                                  ((INSTANCE) == USART4) || \
                                                  ((INSTANCE) == USART5) || \
                                                  ((INSTANCE) == USART6) || \
                                                  ((INSTANCE) == USART7) || \
                                                  ((INSTANCE) == USART8))

/****************************** WWDG Instances ********************************/
#define IS_WWDG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == WWDG)

/**
  * @}
  */


/******************************************************************************/
/*  For a painless codes migration between the STM32F0xx device product       */
/*  lines, the aliases defined below are put in place to overcome the         */
/*  differences in the interrupt handlers and IRQn definitions.               */
/*  No need to update developed interrupt code when moving across             */
/*  product lines within the same STM32F0 Family                              */
/******************************************************************************/

/* Aliases for __IRQn */
#define ADC1_IRQn                ADC1_COMP_IRQn
#define DMA1_Channel1_IRQn       DMA1_Ch1_IRQn
#define DMA1_Channel2_3_IRQn     DMA1_Ch2_3_DMA2_Ch1_2_IRQn
#define DMA1_Channel4_5_6_7_IRQn DMA1_Ch4_7_DMA2_Ch3_5_IRQn
#define DMA1_Channel4_5_IRQn     DMA1_Ch4_7_DMA2_Ch3_5_IRQn
#define RCC_IRQn                 RCC_CRS_IRQn
#define TIM6_IRQn                TIM6_DAC_IRQn
#define USART3_6_IRQn            USART3_8_IRQn
#define USART3_4_IRQn            USART3_8_IRQn
#define PVD_VDDIO2_IRQn          VDDIO2_IRQn
#define PVD_IRQn                 VDDIO2_IRQn

#define SVC_IRQn                 SVCall_IRQn

/* Aliases for __IRQHandler */
#define ADC1_IRQHandler                ADC1_COMP_IRQHandler
#define DMA1_Channel1_IRQHandler       DMA1_Ch1_IRQHandler
#define DMA1_Channel2_3_IRQHandler     DMA1_Ch2_3_DMA2_Ch1_2_IRQHandler
#define DMA1_Channel4_5_6_7_IRQHandler DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler
#define DMA1_Channel4_5_IRQHandler     DMA1_Ch4_7_DMA2_Ch3_5_IRQHandler
#define RCC_IRQHandler                 RCC_CRS_IRQHandler
#define TIM6_IRQHandler                TIM6_DAC_IRQHandler
#define USART3_6_IRQHandler            USART3_8_IRQHandler
#define USART3_4_IRQHandler            USART3_8_IRQHandler
#define PVD_VDDIO2_IRQHandler          VDDIO2_IRQHandler
#define PVD_IRQHandler                 VDDIO2_IRQHandler

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* __STM32F098xx_H */

/**
  * @}
  */

/**
  * @}
  */

